ednieuw/RTCcheck/Old/ESP32_RTCcheckV015/ESP32_RTCcheckV015.ino
//--------------------------------------------
// RTC8 Calculate difference in sec from NTP
//--------------------------------------------
void CalcDifRTCtimes(void)
{
 struct tm ntp_tm = timeinfo;
 ntp_tm.tm_isdst = -1;
 const time_t tNTP = mktime(&ntp_tm);
 for (int i = 0; i < MAX_RTC; i++)
   {
    if (!rtcActive[i]) { RTCdiffSec[i] = -1; continue; }
    selectTCAChannel(i);
    delay(10);
    RTCdiffSec[i] = abs(tNTP - to_time_t(rtc[i].now()));
   }
}

//--------------------------------------------                       //
// RTC8 Update the time difference in the LEDs
// 1 second sec * -10 GREEN sec * 10 RED
// BLUE is empty
// max time difference = 25 seconds. 26 = NA
//--------------------------------------------
void UpdateRTCTimeLEDs(void)
{
 CalcDifRTCtimes();                                                 // Calculate difference in sec from NTP
 for (int i = 0; i < MAX_RTC; i++)                                  // Read time of all ACTIVE RTC modules
  {
   int c;
   if (!rtcActive[i]) c = -1;                                       // Skip non-active RTC's 
   else c = RTCdiffSec[i]; 
   switch (c)
    {
      case  0 ...  1: ColorLed(i,green);     Tekstprint("|green ");      break;
      case  2 ...  4: ColorLed(i,orange);    Tekstprint("|orange ");     break;
      case  5 ...  7: ColorLed(i,greenblue); Tekstprint("|greenblue ");  break;
      case  8 ... 10: ColorLed(i,darkviolet);Tekstprint("|darkviolet "); break;
      case 11 ... 17: ColorLed(i,pink);      Tekstprint("|pink ");       break;
      case 18 ... 25: ColorLed(i,purple);    Tekstprint("|purple ");     break;
      case 26 ...999: ColorLed(i,red);       Tekstprint("|red ");        break;
      default:        ColorLed(i,blue);      Tekstprint("|blue ");
    }
  }
ShowLeds(); 
}

//--------------------------------------------                       //
// RTC8 Print RTC differences from NTP
//--------------------------------------------
void PrintDifRTCtimes(void)
{
 Tekstprint("");
 CalcDifRTCtimes();
 for (int i = 0; i < MAX_RTC; i++) 
  {  
   if (!rtcActive[i]) { continue; } 
   sprintf(sptext,"|T%d:%2ld",i,RTCdiffSec[i]);
   Tekstprint(sptext);
  }
 Tekstprint("| ");
}
//--------------------------------------------                       //
// RTC8 Function to select TCA9548A channel
//--------------------------------------------
void selectTCAChannel(uint8_t channel) 
{
  if (channel > 7) return;                                           // Maximaal 8 kanalen (0-7)
  Wire.beginTransmission(TCA_ADDR);
  Wire.write(1 << channel);                                          // Select channel by setting bit
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) 
   {
    sprintf(sptext,"Error selecting channel %d Error code : %d", channel,error);
    Tekstprintln(sptext);  
  }
  delay(10);                                                         // short delay after channel change
}
//--------------------------------------------                       //
// RTC8 set Time For RTC 
//--------------------------------------------
void setTimeForRTC(int rtcIndex, DateTime newTime) 
{
  if (!rtcActive[rtcIndex]) return;
  selectTCAChannel(rtcIndex);
  rtc[rtcIndex].adjust(newTime);
}
//--------------------------------------------                       //
// RTC8 Print Time For RTC 
//--------------------------------------------
void printTimeForRTC(int rtcIndex) 
{
  if (!rtcActive[rtcIndex]) return;
  selectTCAChannel(rtcIndex);
  DateTime now = rtc[rtcIndex].now();

  sprintf(sptext,"RTC %d: %s", rtcIndex, now.timestamp(DateTime::TIMESTAMP_FULL).c_str());
  Tekstprintln(sptext);  
}
//--------------------------------------------                       //
// RTC8 get Temperature For RTC
//--------------------------------------------
float getTemperatureForRTC(int rtcIndex) 
{
  if (!rtcActive[rtcIndex]) return -999;
  selectTCAChannel(rtcIndex);
  return rtc[rtcIndex].getTemperature();
}
//--------------------------------------------                                                //
// RTC8 Synchronize all RTC's with current time
//--------------------------------------------
void synchronizeAllRTCs()   // Zoek eerste actieve RTC als referentie
{
  int referenceRTC = -1;
  for (int i = 0; i < MAX_RTC; i++) { if (rtcActive[i]) { referenceRTC = i;   break;  }  }
  if (referenceRTC == -1)           { Tekstprintln("No active RTC's found!"); return;  }
  
  selectTCAChannel(referenceRTC);
  DateTime referenceTime = GetLocalDateTime() + 1;                                               // Get the current time and add 1 sec setting time  
  
  Tekstprintln("\n=== RTC SYNCHRONISATION ===");
  sprintf(sptext,"Reference time of NTP RTC %d: %s", referenceRTC, referenceTime.timestamp(DateTime::TIMESTAMP_FULL).c_str());
  Tekstprintln(sptext);

  for (int i = 0; i < MAX_RTC; i++) 
   {
    if (!rtcActive[i]) continue;
    selectTCAChannel(i);
    delay(50);
    DateTime before = rtc[i].now();                                  // Show time before update
    sprintf(sptext,"RTC %d: before sync %s", i, before.timestamp(DateTime::TIMESTAMP_FULL).c_str());
    Tekstprintln(sptext);
    rtc[i].adjust(referenceTime);                                    // Update time
    delay(50); 
    DateTime after = rtc[i].now();                                   // Verify
    sprintf(sptext,"RTC %d:  after sync %s", i, after.timestamp(DateTime::TIMESTAMP_FULL).c_str());
    Tekstprintln(sptext);
  }
 Tekstprintln("Synchronisation done!\n");
}

//--------------------------------------------                       //
// RTC8 Set time by hand in serial monitor
//--------------------------------------------
void setCurrentTime() 
{
 int year, month, day, hour, minute, second;                        //
 hour   = timeinfo.tm_hour;
 minute = timeinfo.tm_min;
 second = timeinfo.tm_sec;
 year   = timeinfo.tm_year + 1900;                                                      // Inow.year() is years since 2000 tm_year is years since 1900
 month  = timeinfo.tm_mon  + 1;
 day    = timeinfo.tm_mday;
 DateTime newTime(year, month, day, hour, minute, second);
 Tekstprint("New time: ");
 Tekstprintln(newTime.timestamp(DateTime::TIMESTAMP_FULL).c_str());
 for (int i = 0; i < MAX_RTC; i++) 
    {
     if (!rtcActive[i]) continue;
     selectTCAChannel(i);
     delay(50);      
     DateTime before = rtc[i].now();                                // Show time before update
     sprintf(sptext,"RTC %d: before sync %s", i, before.timestamp(DateTime::TIMESTAMP_FULL).c_str());
     Tekstprintln(sptext);
     rtc[i].adjust(newTime);
     delay(50);
     DateTime after = rtc[i].now();                                 // Verify
     sprintf(sptext,"RTC %d: after sync %s", i, after.timestamp(DateTime::TIMESTAMP_FULL).c_str());
     Tekstprintln(sptext);
    }
 Tekstprintln("All active RTC's updated!\n");
}

//--------------------------------------------                                                //
// COMMON Update routine for the status LEDs
//-------------------------------------------- 
void UpdateStatusLEDs(int Toggle)
{
 if(Mem.StatusLEDOn)   
   {
    SetStatusLED((Toggle && WiFi.localIP()[0]==0) * 20, 
                 (Toggle && WiFi.localIP()[0]!=0) * 20 , 
                 (Toggle &&      deviceConnected) * 20);
    SetPCBLED09( Toggle * 10);                                                                // Left LED
    SetPCBLED10((!Toggle) * 10);                                                             // Right LED
    SetNanoLED13((!Toggle) * (!Mem.UseDS3231 * 50));                                         // LED on ESP32 board. IF DS3231 in use then it is off
   }
   else
   {
    SetStatusLED(0, 0, 0); 
    SetPCBLED09(0);                                                                           //
    SetPCBLED10(0);                                                                           //
    SetNanoLED13(0);      
   }
}
//--------------------------------------------                                                //
// COMMON Control the RGB LEDs on the Nano ESP32
// Analog range 0 - 512. 0 is LED Off, 512 is max intensity
// 512 is LED off. Therefore the value is subtracted from 512
// in core 3 the value to write is 13-bit 8191 to turn off the led completely
//  rgbLedWrite(512-Red,512-Green,512-Blue);
//--------------------------------------------
void SetStatusLED(int Red, int Green, int Blue)                                               // If LED should be off, use digitalWrite instead of analogWrite
{
 analogWrite(LED_RED,   Red   == 0 ? 8191 : (512 - Red));
 analogWrite(LED_GREEN, Green == 0 ? 8191 : (512 - Green));
 analogWrite(LED_BLUE,  Blue  == 0 ? 8191 : (512 - Blue));
}
//--------------------------------------------                                                //
// COMMON Control orange LED D13 on the Arduino 
//--------------------------------------------
void SetNanoLED13(int intensity) {analogWrite(secondsPin, intensity);}
//--------------------------------------------                                                //
// COMMON Control the RGB LED on the PCB
//--------------------------------------------
void SetPCBLED09(int intensity) {analogWrite(PCB_LED_D09, intensity);}
void SetPCBLED10(int intensity) {analogWrite(PCB_LED_D10, intensity);}

//--------------------------------------------                                                //
// COMMON check for serial input
//--------------------------------------------
void SerialCheck(void)
{
 String SerialString; 
 while (Serial.available())
    { 
     char c = Serial.read();                                                                  // Serial.write(c);
     if (c>31 && c<128) SerialString += c;                                                    // Allow input from Space - Del
     else c = 0;                                                                              // Delete a CR
    }
 if (SerialString.length()>0) 
    {
     ReworkInputString(SerialString);                                                         // Rework ReworkInputString();
     SerialString = "";
    }
}

//--------------------------------------------                                                //
// COMMON Reset to default settings. BLE On, WIFI NTP Off
//--------------------------------------------
void Reset(void)
{
 Mem.Checksum         = 25065;                                                                //
 Mem.DisplayChoice    = 0;                                                                    // Default colour scheme 
 Mem.OwnColour        = green;                                                                // Own designed colour.
 Mem.DimmedLetter     = dgray;
 Mem.BackGround       = black; 
 Mem.LanguageChoice   = 0;                                                                    // 0 = NL, 1 = UK, 2 = DE, 3 = FR, 4 = Wheel
 Mem.LightReducer     = SLOPEBRIGHTNESS;                                                      // Factor to dim ledintensity with. Between 0.1 and 1 in steps of 0.05
 Mem.UpperBrightness  = MAXBRIGHTNESS;                                                        // Upper limit of Brightness in bits ( 1 - 1023)
 Mem.LowerBrightness  = LOWBRIGHTNESS;                                                        // Lower limit of Brightness in bits ( 0 - 255)
 Mem.TurnOffLEDsAtHH  = 0;                                                                    // Display Off at nn hour
 Mem.TurnOnLEDsAtHH   = 0;                                                                    // Display On at nn hour Not Used
 Mem.TimeMinute       = 1;                                                                    // Print time per minute (1) or hour (2)
 Mem.HetIsWasOff      = 0;                                                                    // Turn On or Off HET IS WAS   
 Mem.EdSoftLEDSOn     = 0;                                                                    // Turn On or Off EDSOFT LEDs
 Mem.RandomDisplay    = 0;                                                                    // Choose every day another display
 Mem.WIFInoConnection = 0;                                                                    // Restarts after 30 minutes no connection 
 Mem.BLEOn            = 1;                                                                    // default BLE On
 Mem.UseBLELongString = 0;                                                                    // Default off. works only with iPhone/iPad with BLEserial app
 Mem.NTPOn            = 0;                                                                    // NTP default off
 Mem.WIFIOn           = 0;                                                                    // WIFI default off
 Mem.MCUrestarted     = 0;                                                                    // MCU Restarts during Setup() counter caused by unknown errors during startup
 Mem.LoopRebooted     = 0;                                                                    // Reboots cause by less than 10 loops /second. Program hangs or severly delayed
 Mem.WIFIcredentials  = NOT_SET;                                                              // Status of the WIFI connection
 //Mem.UseRotary      = 0;    // Do not erase this setting with a reset                       // Use the rotary coding
 Mem.DCF77On          = 0;                                                                    // Default off
 Mem.UseDS3231        = 0;                                                                    // Default off
 //Mem.LEDstrip       = 0;    // Do not erase this setting with a reset                       // 0 = SK6812, 1=WS2812
 Previous_LDR_read    = ReadLDR();                                                            // Read LDR to have a start value. max = 4096/8 = 255
 MinPhotocell         = Previous_LDR_read;                                                    // Stores minimum reading of photocell;
 MaxPhotocell         = Previous_LDR_read;                                                    // Stores maximum reading of photocell;                                            
 TestLDR              = 0;                                                                    // If true LDR display is printed every second
 for (int i = 0; i < NOOFBUTTONS; i++)  IRMem.buttons[i].learned = 0;
 Tekstprintln("**** Reset of preferences ****"); 
 //ResetCredentials();
 StoreStructInFlashMemory();                                                                  // Update Mem struct       
 GetTijd(false);                                                                              // Get the time and store it in the proper variables
 SWversion();                                                                                 // Display the version number of the software
 Displaytime();
}
//--------------------------------------------                                                //
// COMMON Reset to empty credential settings WIFI, NTP, BLE ON
//--------------------------------------------
void ResetCredentials(void)
{
 strcpy(Mem.SSID,"");                                                                         // Default SSID
 strcpy(Mem.Password,"");                                                                     // Default password
 strcpy(Mem.BLEbroadcastName,"ESP32Nano");
 strcpy(Mem.Timezone,"CET-1CEST,M3.5.0,M10.5.0/3");                                           // Central Europe, Amsterdam, Berlin etc.
 Mem.WIFIcredentials  = 0;                                                                    // Status of the WIFI connection  
 Mem.WIFIOn           = 1;                                                                    // WIFI on
 Mem.NTPOn            = 1;
 Mem.BLEOn            = 1;                                                                    // default BLE On
 StoreStructInFlashMemory();                                                                  // Update Mem struct   
}

//--------------------------------------------                                                //
// COMMON common print routines
// %s - String
// %d - Integer (decimal)
// %04X - Hex with 4 digits, uppercase, leading zeros
// %08X - Hex with 8 digits, uppercase, leading zeros
// PRIX32 - 32-bit hex for uint32_t values
//--------------------------------------------
void Tekstprint(char const *tekst)    { if(Serial) Serial.print(tekst);  SendMessageBLE(tekst); AddLog(tekst);} //sptext[0]=0; } 
void Tekstprintln(char const *tekst)  { snprintf(sptext, sizeof(sptext),"%s\n",tekst); Tekstprint(sptext); }
void TekstSprint(char const *tekst)   { printf(tekst); } //sptext[0]=0;}                      // printing for Debugging purposes in serial monitor 
void TekstSprintln(char const *tekst) { snprintf(sptext, sizeof(sptext),"%s\n",tekst); TekstSprint(sptext); }

//--------------------------------------------                                                //
// Usage:
// COMMON Tekstprintlnf("Log buffer allocated: %u bytes", (unsigned) LogBufferSize);
// COMMON Tekstprintf("Log buffer allocated: %u bytes\n", (unsigned) LogBufferSize);
//--------------------------------------------
void Tekstprintf(const char* fmt, ...) 
 {
  va_list args;
  va_start(args, fmt);
  vsnprintf(sptext, sizeof(sptext), fmt, args);
  va_end(args);
  Tekstprint(sptext);
 }

void Tekstprintlnf(const char* fmt, ...) 
 {
  va_list args;
  va_start(args, fmt);
  vsnprintf(sptext, sizeof(sptext), fmt, args);
  va_end(args);
  Tekstprintln(sptext);
}

//--------------------------------------------                                                //
// COMMON Print web menu page and BLE menu
// 0 = text to print, 1 = header of web page with menu, 2 = footer of web page
// html_info must be empty before starting: --> html_info[0] = 0; 
//--------------------------------------------
void WTekstappend(char const *tekst, char const *prefixtekst, char const *suffixtekst, bool newline) 
{
 if (newline) { snprintf(sptext, sizeof(sptext), "%s\n", tekst); } 
 else {         snprintf(sptext, sizeof(sptext), "%s", tekst);   }
 if(Mem.MCUrestarted == 0) Tekstprint(sptext);                                                // During a normal startup the menu is printed during startup proces.
 size_t needed = strlen(prefixtekst) + strlen(tekst) + strlen(suffixtekst) + strlen("<br>");  // Estimate how much space will be added
 if (strlen(html_info) + needed > MAXSIZE_HTML_INFO - 1) 
     { strcat(html_info, "<br> *** Increase MAXSIZE_HTML_INFO ***<br>");   return;  }
 strcat(html_info, prefixtekst);                                             
 strcat(html_info, tekst);
 strcat(html_info, suffixtekst);
 if (newline) { strcat(html_info, "<br>"); }   // Append to html_info
}

void WTekstprintln(char const *tekst) { WTekstappend(tekst, "", "", true);}
void WTekstprintln(char const *tekst, char const *prefixtekst, char const *suffixtekst) 
                                      { WTekstappend(tekst, prefixtekst, suffixtekst, true); }

